/*- Користувач вводить або має два числа.
    Потрібно знайти та вивести максимальне число з тих двох .
    Також потрібно врахувати коли введені рівні числа.*/
/*let number1 = prompt('n1')
    let number2 = prompt('n2')
    if(number1<number2){
        console.log(number2)
    }else if(number2<number1){
        console.log(number2)
    }else{
        console.log('числі рівні')
    }*/


/*- У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
Користувач вводить номер квартири просто в змінні або через prompt('') .
    Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.*/
/*
let number = prompt()
if(number>1&&number<20){
    console.log('перший')
}else if(number>21&&number<48){
    console.log('другий')
}else if(number>49&&number<90){
    console.log('третій')
}else{
    console.log('не шастай тут')
}
*/


/*- Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО,
 якщо змінна не рівна 10 - тоді НЕВІРНО*/
/*let number = +prompt()
number === 10 ? console.log('вірно') : console.log('не вірно')*/

/*- Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
    якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
якщо в змінну записали щось інше, спрацьовує else*/
/*let a
    if (typeof a ==="number"){
        console.log(1)
    }else if (typeof a ==="string"){
        console.log(2)
    }else if (typeof a ==="boolean"){
        console.log(3)
    }else if (typeof a ==="object"){
    console.log(4)
}else {
        console.log('error')
    }*/

/*
- Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
    Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
    Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
*/
/*let t = +prompt('температура')
if (t >= 10 && t <= 22){
    console.log('ми йдемо ВЧИТИСЯ')
}else {
    console.log('сидимо вдома і вчимося ОНЛАЙН')
}*/

/*
- За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
    числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .*/
let number = +prompt('Введіть число від 1 до 5')
switch (number) {
    case 1:
        console.log('авто');
        break;
    case 2:
        console.log('мото');
        break;
    case 3:
        console.log('телефон');
        break;
    case 4:
        console.log('лящ');
        break;
    case 5:
        console.log('цукерка')
        break;
    default:
        console.log("ти програв");
}
