/*зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
    1. перебрати його циклом while*/
/*let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
while (arr.length > 0) {
    console.log(arr)
}*/
/*2. перебрати його циклом for*/
/*let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
for (i = 0; i< arr.length; i++) {
    console.log(arr)
}*/
/*3. перебрати циклом while та вивести  числа тільки з непарним індексом*/

/*4. перебрати циклом for та вивести  числа тільки з непарним індексом*/
/*let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
for (let i = 0; i < arr.length; i++) {
    if (i % 2 === 1) {
        console.log(arr);
    }
}*/
/*5. перебрати циклом while та вивести  числа тільки парні  значення*/

/*6. перебрати циклом for та вивести  числа тільки парні  значення*/
/*let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
for (let i = 0; i < arr.length; i++) {
    if (i % 2 === 0) {
        console.log('не парний : ' + i + ' ');
    }
}*/
/*7. замінити кожне число кратне 3 на слово "okten"*/
/*8. вивести масив в зворотньому порядку.*/

/*9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)*/
