

//- Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
//(в першу, другу, третю или четверту частину години).
let time = prompt('Введіть хвилину від 0 до 59');
if (time >= 0 && time <= 14) {
    console.log('1 чверть')
} else if (time >= 15 && time <= 29) {
    console.log('2 чверть')
} else if (time >= 30 && time <= 44) {
    console.log('3 чверть')
} else if (time >= 45 && time <= 59) {
    console.log('4 чверть')
} else {
    console.log('введіть від 0 до 59')
}

//- У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

let day = prompt('Введіть число місяця від 1 до 31');
if (day >= 1 && day <= 10) {
    console.log('1 декада')
} else if (day >= 11 && day <= 20) {
    console.log('2 декада')
} else if (day >= 21 && day <= 31) {
    console.log('3 декада')
} else {
    console.log('введіть від 1 до 31')
}



//- У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//  Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта -
//  з коротким записом(тернаркою)

let test =;
if (test === true) {
    console.log('вірно')
} else {
    console.log('невірно')
}
//(test === true) ? console.log('вірно') : console.log('невірно')


//- Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.
// Перевірте  скрипт при a, що дорівнює 1, 0, -3

let number = prompt('Введіть число 1, 0 , -3');
if (number !== 0) {
    console.log('вірно')
} else {
    console.log('невірно')
}

//(number !== 0) ? console.log('вірно') : console.log('невірно')





//- Скласти розклад на тиждень за домопоги switch.
// Користувач вводить порядковий номер дня тижня і на екрані
// відображається інфа що заплановано на цей день.

let dayOfWeeks = +prompt('Введіть день тижня від 1 до 7')
 switch (dayOfWeeks) {
     case 1:
         console.log('ПОНЕДІЛОК: купити продукти на тиждень');
         break;
     case 2:
         console.log('ВІВТОРОК: читати книгу JS');
         break;
     case 3:
         console.log('СЕРЕДА: онлайн заняття');
         break;
     case 4:
         console.log('ЧЕТВЕР: стаціонарне заняття');
         break;
     case 5:
         console.log('ПЯТНИЦЯ: зустріч з друзями');
         break;
     case 6:
         console.log('СУБОТА: готую обід');
         break;
     case 7:
         console.log('НЕДІЛЯ: рибалка');
         break;
     default:
         console.log("Ти щось не то ввів");
 }


//- Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.


let year = prompt('Введіть кількість днів у році');

 if(year % 4 === 0){
     console.log('Рік високосний');
 }else {
     console.log('рік не високосний');
 }
//(prompt('Введіть кількість днів у році') % 4 === 0) ? console.log('Рік високосний') : console.log('рік не високосний');

//- Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
//Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

let name = prompt('Яка «офіційна» назва JavaScript?');
 if(name === 'ECMAScript'){
    alert('Правильно!');
 } else{
    alert('Не знаєте? ECMAScript!');
 }
